---   

<h1 align="center">Introduction to Data Analyst and Data Science for beginners</h1>
<h1 align="center">Introduction to DBMS and SQL for beginners</h1>

---
<h3><div align="right">Ehtisham Sadiq</div></h3>

# Learning Agenda of this Notebook:
- What is Data?
- What is Database?
- Famous types of Databases
- What is RDBMS?
- DBMS vs RDBMS?
- What is SQL?
- SQL vs MySQL
- Why SQL?
- Types of SQL Commands?
 >- DDL
 >- DML
 >- DCL
 >- TCL
 >- DQL
- Difference between SQL AND NoSQL
- Advantages and Dis-advantages of SQL
- What is SQL Syntax?
- Datatypes in SQL
- SQL Operators
- What is SQL Statement?
- SQL Database Commands
 >- SQL CREATE Database
 >- SQL DROP Database
 >- SQL RENAME Database
 >- SQL SELECT Database
 
- SQL Table Commands
 >- What is Table
 >- SQL CREATE TABLE
 >- SQL DROP TABLE
 >- SQL DELETE TABLE
 >- SQL RENAME TABLE
 >- SQL TRUNCATE TABLE
 >- SQL COPY TABLE
 >- SQL TEMP TABLE
 >- SQL ALTER TABLE
 
- SQL SELECT Commands
 >- SELECT Statement
 >- SQL SELECT UNIQUE
 >- SQL SELECT DISTINCT
 >- SQL SELECT COUNT
 >- SQL SELECT TOP
 >- SQL SELECT FIRST
 >- SQL SELECT LAST
 >- SQL SELECT RANDOM
 >- SQL SELECT IN
 >- SQL SELECT Multiple
 >- SQL SELECT DATE
 >- SQL SELECT SUM
 >- SQL SELECT NULL

- SQL Clause
>- SQL WHERE
>- SQL AND
>- SQL OR
>- SQL WITH
>- SQL AS
>- SQL HAVING Clause

- SQL Order By
>- ORDER BY Clause
>- ORDER BY ASC
>- ORDER BY DESC
>- ORDER BY RANDOM
>- ORDER BY LIMIT
>- ORDER BY Multiple Cols

- SQL Insert commands
>- INSERT Statement
>- INSERT INTO Values
>- INSERT INTO SELECT
>- INSERT Multiple Rows

- SQL Update
>- UPDATE Statement
>- SQL UPDATE JOIN
>- SQL UPDATE DATE

- SQL Delete
>- DELETE Statement
>- SQL DELETE TABLE
>- SQL DELETE ROW
>- SQL DELETE All Rows
>- DELETE Duplicate Rows
>- SQL DELETE DATABASE
>- SQL DELETE VIEW
>- SQL DELETE JOIN

- SQL Join commands
>- SQL JOIN
>- SQL Outer Join
>- SQL Left Join
>- SQL Right Join
>- SQL Full Join
>- SQL Cross Join

- SQL Keys
>- Primary Key
>- Foreign Key
>- Composite Key
>- Unique Key
>- Alternate Key

- SQL Data Types
 >- String Data types
 >- Numeric Data types
 >- Date and time Data types
- SQL Operators
 >- What is SQL Operator?
 >- What is the Precedence of SQL Operator?
 >- Types of Operator
  - SQL Arithmetic Operators
  >- SQL Comparison Operators
  >- SQL Logical Operators
  >- SQL Set Operators
  >- SQL Bit-wise Operators
  >- SQL Unary Operators
  
- Difference
>- IN vs EXISTS
>- Group By vs Order By
>- WHERE vs HAVING
>- Where condition in SQL

- Interview Questions Answers
- Case Studies
- Python MySQL
 >- Environment Setup
 >- Database Connection
 >- Creating New Database
 >- Creating Tables
 >- Insert Operation
 >- Read Operation
 >- Update Operation
 >- Join Operation
 >- Performing Transactions

# What is Data?
- Data is a collection of a distinct small unit of information. It can be used in a variety of forms like text, numbers, media, bytes, etc. it can be stored in pieces of paper or electronic memory, etc.
- In computing, Data is information that can be translated into a form for efficient movement and processing. Data is interchangeable.

# What is Database?
- A database is an organized collection of data, so that it can be easily accessed and managed.
- You can organize data into tables, rows, columns, and index it to make it easier to find relevant information.
- Database handlers create a database in such a way that only one set of software program provides access of data to all the users.
- The main purpose of the database is to operate a large amount of information by storing, retrieving, and managing data.
- There are many dynamic websites on the World Wide Web nowadays which are handled through databases. For example, a model that checks the availability of rooms in a hotel. It is an example of a dynamic website that uses a database.
- There are many databases available like MySQL, Sybase, Oracle, MongoDB, Informix, PostgreSQL, SQL Server, etc.
- Modern databases are managed by the database management system (DBMS).
- SQL or Structured Query Language is used to operate on the data stored in a database. SQL depends on relational algebra and tuple relational calculus.

# Types of Databases:
There are various types of databases used for storing different varieties of data.
![](types-of-databases.png)

### Centralized Database
- It is the type of database that stores data at a centralized database system. It comforts the users to access the stored data from different locations through several applications. These applications contain the authentication process to let users access data securely. 
- An example of a Centralized database can be Central Library that carries a central database of each library in a college/university.

### Distributed Database
- Unlike a centralized database system, in distributed systems, data is distributed among different database systems of an organization. These database systems are connected via communication links. Such links help the end-users to access the data easily. 
- Examples of the Distributed database are Apache Cassandra, HBase, Ignite, etc.

### Relational Database
- This database is based on the relational data model, which stores data in the form of rows(tuple) and columns(attributes), and together forms a table(relation). A relational database uses SQL for storing, manipulating, as well as maintaining the data. E.F. Codd invented the database in 1970. Each table in the database carries a key that makes the data unique from others. 
- Examples of Relational databases are MySQL, Microsoft SQL Server, Oracle, etc.
<img src="images/relational theory.png">

### NoSQL Database
Non-SQL/Not Only SQL is a type of database that is used for storing a wide range of data sets. It is not a relational database as it stores data not only in tabular form but in several different ways. It came into existence when the demand for building modern applications increased. Thus, NoSQL presented a wide variety of database technologies in response to the demands.

### Cloud Database
A type of database where data is stored in a virtual environment and executes over the cloud computing platform. It provides users with various cloud computing services (SaaS, PaaS, IaaS, etc.) for accessing the database. There are numerous cloud platforms, but the best options are:

- Amazon Web Services(AWS)
- Microsoft Azure
- Kamatera
- PhonixNAP
- ScienceSoft
- Google Cloud SQL, etc.

### Object-oriented Databases
The type of database that uses the object-based data model approach for storing data in the database system. The data is represented and stored as objects which are similar to the objects used in the object-oriented programming language.

### Hierarchical Databases
- It is the type of database that stores data in the form of parent-children relationship nodes. Here, it organizes data in a tree-like structure.
- Data get stored in the form of records that are connected via links. Each child record in the tree will contain only one parent. On the other hand, each parent record can have multiple child records.
<img src="images/types-of-databases4.png">

### Personal Database
Collecting and storing data on the user's system defines a Personal Database. This database is basically designed for a single user.

# What is RDBMS (Relational Database Management System)
- `RDBMS` stands for Relational Database Management System.
- All modern database management systems like SQL, MS SQL Server, IBM DB2, ORACLE, My-SQL, and Microsoft Access are based on RDBMS.
- It is called Relational Database Management System (RDBMS) because it is based on the relational model introduced by E.F. Codd.

### How it works
- Data is represented in terms of tuples (rows) in RDBMS.
- A relational database is the most commonly used database. It contains several tables, and each table has its primary key.
- Due to a collection of an organized set of tables, data can be accessed easily in RDBMS.
<img src="images/what-is-rdbms.png">

# Difference between DBMS and RDBMS
### DBMS:
- DBMS applications store data as file.
- In DBMS, data is generally stored in either a hierarchical form or a navigational form.
- DBMS uses file system to store data, so there will be no relation between the tables.
- DBMS has to provide some uniform methods to access the stored information.
- DBMS does not support distributed database.
- DBMS is meant to be for small organization and deal with small data. it supports single user.
- Examples of DBMS are file systems, xml etc.

### RDBMS:
- RDBMS applications store data in a tabular form.
- In RDBMS, the tables have an identifier called primary key and the data values are stored in the form of tables.
- In RDBMS, data values are stored in the form of tables, so a relationship between these data values will be stored in the form of a table as well.
- RDBMS system supports a tabular structure of the data and a relationship between them to access the stored information.
- RDBMS supports distributed database.
- RDBMS is designed to handle large amount of data. it supports multiple users.
- Example of RDBMS are mysql, postgre, sql server, oracle etc.

# What is SQL?
- SQL is a short-form of the structured query language.
- This database language is mainly designed for maintaining the data in relational database management systems. It is a special tool used by data professionals for handling structured data (data which is stored in the form of tables). It is also designed for stream processing in RDSMS.
- You can easily create and manipulate the database, access and modify the table rows and columns, etc.

# SQL vs MySQL
<img src="images/Difference-Between-SQL-and-MySQL-Comparison-Summary.jpg" height=600px width=600px>

# Why SQL?
Nowadays, SQL is widely used in data science and analytics. Following are the reasons which explain why it is widely used:

- The basic use of SQL for data professionals and SQL users is to insert, update, and delete the data from the relational database.
- SQL allows the data professionals and users to retrieve the data from the relational database management systems.
- It also helps them to describe the structured data.
- It allows SQL users to create, drop, and manipulate the database and its tables.
- It also helps in creating the view, stored procedure, and functions in the relational database.
- It allows you to define the data and modify that stored data in the relational database.
- It also allows SQL users to set the permissions or constraints on table columns, views, and stored procedures.

# Types of SQL Commands
- SQL commands are instructions. It is used to communicate with the database. It is also used to perform specific tasks, functions, and queries of data.
- SQL can perform various tasks like create a table, add data to tables, drop the table, modify the table, set permission for users.
### Types of SQL Commands
- There are five types of SQL commands: DDL, DML, DCL, TCL, and DQL.
<img src=" images/dbms-sql-command.png">

### Data Definition Language (DDL)
- DDL changes the structure of the table like creating a table, deleting a table, altering a table, etc.
- All the command of DDL are auto-committed that means it permanently save all the changes in the database.
Here are some commands that come under DDL:
 >- CREATE(t is used to create a new table in the database.)
 >- ALTER (It is used to delete both the structure and record stored in the table.)
 >- DROP (It is used to alter the structure of the database. This change could be either to modify the characteristics of an existing attribute or probably to add a new attribute.)
 >- TRUNCATE ( It is used to delete all the rows from the table and free the space containing the table.)
 
 
### Data Manipulation Language
- DML commands are used to modify the database. It is responsible for all form of changes in the database.
- The command of DML is not auto-committed that means it can't permanently save all the changes in the database. They can be rollback.
Here are some commands that come under DML:

 >- INSERT(The INSERT statement is a SQL query. It is used to insert data into the row of a table.)
 >- UPDATE(This command is used to update or modify the value of a column in the table.)
 >- DELETE(It is used to remove one or more row from a table.)
 
 
### Data Control Language
- DCL commands are used to grant and take back authority from any database user.
Here are some commands that come under DCL:
 >- grant(It is used to give user access privileges to a database)
 >- Revoke(It is used to take back permissions from the user.)


### Transaction Control Language
- TCL commands can only use with DML commands like INSERT, DELETE and UPDATE only.
- These operations are automatically committed in the database that's why they cannot be used while creating tables or dropping them.
Here are some commands that come under TCL:
 >- COMMIT(Commit command is used to save all the transactions to the database.)
 >- ROLLBACK(Rollback command is used to undo transactions that have not already been saved to the database.)
 >- SAVEPOINT(It is used to roll the transaction back to a certain point without rolling back the entire transaction.)
 
### Data Query Language
- DQL is used to fetch the data from the database.
It uses only one command:
 >- SELECT(This is the same as the projection operation of relational algebra. It is used to select the attribute based on the condition described by WHERE clause.)

# SQL vs NoSQL
- Databases are categorized as Relational Database Management System (RDBMS) while NoSQL databases are categorized as Non-relational or distributed database system.
- SQL databases have fixed or static or predefined schema while NoSQL databases have dynamic schema.
- SQL databases display data in form of tables so it is known as table-based database while NoSQL databases display data as collection of key-value pair, documents, graph databases or wide-column stores.
- SQL databases are vertically scalable while NoSQL databases are horizontally scalable.
- SQL databases are not best suited for hierarchical data storage while NoSQL databases are best suited for hierarchical data storage.
- MySQL, Oracle, Sqlite, PostgreSQL and MS-SQL etc. are the example of SQL database while MongoDB, BigTable, Redis, RavenDB, Cassandra, Hbase, Neo4j, CouchDB etc. are the example of nosql database
<img src="images/nosql_vs_sql-1024x724.jpeg" height=600px width=600px >

# Advantages and Disadvantages of SQL
### Advantages:
- No programming needed
- High Speed Query Processing
- Standardized Language
- Portability
- Interactive language
- More than one Data View

### Disadvantages
- Cost
- Interface is Complex
- Partial Database control

# SQL Syntax
When you want to do some operations on the data in the database, then you must have to write the query in the predefined syntax of SQL.
Following are some most important points about the SQL syntax which are to remember:
- You can write the keywords of SQL in both uppercase and lowercase, but writing the SQL keywords in uppercase improves the readability of the SQL query.
- SQL statements or syntax are dependent on text lines. We can place a single SQL statement on one or multiple text lines.
- You can perform most of the action in a database with SQL statements.
- SQL syntax depends on relational algebra and tuple relational calculus.

# SQL Statement
- SQL statements tell the database what operation you want to perform on the structured data and what information you would like to access from the database.

- The statements of SQL are very simple and easy to use and understand. They are like plain English but with a particular syntax.

#### Simple Example of SQL statement:

`SELECT "column_name" FROM "table_name";`     
Each SQL statement begins with any of the SQL keywords and ends with the semicolon (;). The semicolon is used in the SQL for separating the multiple Sql statements which are going to execute in the same call. In this SQL tutorial, we will use the semicolon (;) at the end of each SQL query or statement.

# Datatypes in SQL
### MySQL String Data Types:

- CHAR(Size)
 >- It is used to specify a fixed length string that can contain numbers, letters, and special characters. Its size can be 0 to 255 characters. Default is 1.
- VARCHAR(Size)	
 >- It is used to specify a variable length string that can contain numbers, letters, and special characters. Its size can be from 0 to 65535 characters.
- BINARY(Size)	
 >- It is equal to CHAR() but stores binary byte strings. Its size parameter specifies the column length in the bytes. Default is 1.
- VARBINARY(Size)	
 >- It is equal to VARCHAR() but stores binary byte strings. Its size parameter specifies the maximum column length in bytes.
- TEXT(Size)	
 >- It holds a string that can contain a maximum length of 255 characters.
- MEDIUMTEXT	
 >- It holds a string with a maximum length of 16,777,215.

### MySQL Numeric Data Types
- BIT(Size)
 >- It is used for a bit-value type. The number of bits per value is specified in size. Its size can be 1 to 64. The default value is 1.
- INT(size)
 >- It is used for the integer value. Its signed range varies from -2147483648 to 2147483647 and unsigned range varies from 0 to 4294967295. The size parameter specifies the max display width that is 255.
- FLOAT(size, d)
 >- It is used to specify a floating point number. Its size parameter specifies the total number of digits. The number of digits after the decimal point is specified by d parameter.
- DOUBLE(size, d)
 >- It is a normal size floating point number. Its size parameter specifies the total number of digits. The number of digits after the decimal is specified by d parameter.
- DECIMAL(size, d)
 >- It is used to specify a fixed point number. Its size parameter specifies the total number of digits. The number of digits after the decimal parameter is specified by d parameter. The maximum value for the size is 65, and the default value is 10. The maximum value for d is 30, and the default value is 0.
- BOOL
 >- It is used to specify Boolean values true and false. Zero is considered as false, and nonzero values are considered as true.

### MySQL Date and Time Data Types
- DATE
 >- It is used to specify date format YYYY-MM-DD. Its supported range is from '1000-01-01' to '9999-12-31'.
- DATETIME(fsp)
 >- It is used to specify date and time combination. Its format is YYYY-MM-DD hh:mm:ss. Its supported range is from '1000-01-01 00:00:00' to 9999-12-31 23:59:59'.
- YEAR	
 >- It is used to specify a year in four-digit format. Values allowed in four digit format from 1901 to 2155, and 0000.

# SQL Database Commands

#### 1. CREATE Database:
This command is used in MySQL to create the new database for storing the structured data.
#### Syntax:
CREATE DATABASE database_name;

#### 2. SHOW Database:
This command shows all the databases in our database.
#### Syntax:
SHOW Databases;

#### 3. SQL DROP Database
The SQL Drop Database statement deletes the existing database permanently from the database system. This statement deletes all the views and tables if stored in the database, so be careful while using this query in SQL.

Following are the most important points which are required to learn before removing the database from the database system:
- This statement deletes all the data from the database. If you want to restore the deleted data in the future, you should keep the backup of data of that database which you want to delete.
- Another most important point is that you cannot delete that database from the system which is currently in use by another database user. If you do so, then the drop statement shows the following error on screen:   
`Cannot drop database "name_of_the_database" because it is currently in use.`   
#### Syntax: 
DROP DATABASE database_name;

We can also delete multiple databases easily by using the single DROP syntax:

`DROP DATABASE Database_Name1, Database_Name2, ......., Database_NameN;  `

#### 4. SQL USE Command
#### Syntax of USE statement in SQL
`USE database_name;`
In this syntax, we have to define the name of the database after the USE keyword and the name of the database must be unique.

### Example 1: 
Suppose, you want to work with the `Hospital` database. For this firstly, you have to check that if the Hospital database exists on the current database server or not by using the following query:     
`SHOW DATABASES;`      

If the Hospital database is shown in the output, then you have to execute the following query to select the Hospital database:

`USE Hospital`;

### Example 2: 
Suppose, you want to work with another `College` database in SQL. For this firstly, you have to check that the College database exists on the current database server or not by using the following query:

`SHOW DATABASES;`  

If the College database is shown in the result, then you have to execute the following query to select the College database:

`USE College;`

# SQL TABLE Commands
- Table is a collection of data, organized in terms of rows and columns. In DBMS term, table is known as relation and row as tuple.
### 1. SQL TABLE Variable
The SQL Table variable is used to create, modify, rename, copy and delete tables. Table variable was introduced by Microsoft.
- Table variables are used to store a set of records. So declaration syntax generally looks like CREATE TABLE syntax.

```
create table "tablename"  
("column1" "data type",  
"column2" "data type",  
...  
"columnN" "data type");  
```
- When a transaction rolled back the data associated with table variable is not rolled back.

- A table variable generally uses lesser resources than a temporary variable.

- Table variable cannot be used as an input or an output parameter.

### 2. SQL CREATE TABLE
- SQL CREATE TABLE statement is used to create table in a database.
- If you want to create a table, you should name the table and define its column and each column's data type.

Let's see the simple syntax to create the table.
```
create table "tablename"  
("column1" "data type",  
"column2" "data type",  
"column3" "data type",  
...  
"columnN" "data type");  
```

- The data type of the columns may vary from one database to another. For example, NUMBER is supported in Oracle database for integer value whereas INT is supported in MySQL.

### Example 3:
Create a database `College` , in this database create a table  `STUDENTS` with ID as primary key and NOT NULL are the constraint showing that these fields cannot be NULL while creating records in the table. Other columns names are name, age, address.

```
CREATE TABLE STUDENTS (  
ID INT                           NOT NULL,  
NAME VARCHAR (20) NOT NULL,  
AGE INT                         NOT NULL,  
ADDRESS CHAR (25),  
PRIMARY KEY (ID)  
);  
```

Note:
 >- DESC command is used to give the descriptive view of database table.

### 3. Create a Table using another table
- We can create a copy of an existing table using the create table command. The new table gets the same column signature as the old table. We can select all columns or some specific columns.
- If we create a new table using an old table, the new table will be filled with the existing value from the old table.



```
CREATE TABLE table_name  AS  
SELECT column1, column2,...   
FROM old_table_name WHERE ..... ;  
```
### Example: 
The following SQL creates a copy of the employee table.  
```
CREATE TABLE EmployeeCopy AS  
SELECT EmployeeID, FirstName, Email  
FROM Employee;  
```

### 4. SQL Primary Key with CREATE TABLE Statement
The following query creates a PRIMARY KEY on the `ID` column when the "Employee" table is created.
```
CREATE TABLE Employee(  
EmployeeID NOT NULL,  
FirstName varchar(255) NOT NULL,  
LastName varchar(255),  
City varchar(255),  
PRIMARY KEY (EmployeeID)  
); 
```

### 5. SQL DROP TABLE
- A SQL DROP TABLE statement is used to delete a table definition and all data from a table.
- This is very important to know that once a table is deleted all the information available in the table is lost forever, so we have to be very careful when using this command.

#### Syntax:
`DROP TABLE "table_name";  `

### 6. SQL DELETE TABLE
The DELETE statement is used to delete rows from a table. If you want to remove a specific row from a table you should use WHERE condition.

```
DELETE FROM table_name [WHERE condition];  
```
But if you do not specify the WHERE condition it will remove all the rows from the table.

```
DELETE FROM table_name;
```
There are some more terms similar to DELETE statement like as DROP statement and TRUNCATE statement but they are not exactly same there are some differences between them.

### Difference between DELETE and TRUNCATE statements
- There is a slight difference b/w delete and truncate statement. The DELETE statement only deletes the rows from the table based on the condition defined by WHERE clause or delete all the rows from the table when condition is not specified.
- But it does not free the space containing by the table.
- The TRUNCATE statement: it is used to delete all the rows from the table and free the containing space.

### Difference b/w DROP and TRUNCATE statements
When you use the drop statement it deletes the table's row together with the table's definition so all the relationships of that table with other tables will no longer be valid.

When you drop a table:

 >- Table structure will be dropped
 >- Relationship will be dropped
 >- Integrity constraints will be dropped
 >- Access privileges will also be dropped
 
On the other hand when we `TRUNCATE` a table, the table structure remains the same, so you will not face any of the above problems.

### 7. SQL RENAME TABLE
- Any database user can easily change the name by using the RENAME TABLE and ALTER TABLE statement in Structured Query Language.
- The RENAME TABLE and ALTER TABLE syntax help in changing the name of the table.
### Syntax
```
RENAME TABLE old_table _name To new_table_name ;    
```

### 8. SQL TRUNCATE TABLE
- A truncate SQL statement is used to remove all rows (complete data) from a table. It is similar to the DELETE statement with no WHERE clause.
- Truncate table is faster and uses lesser resources than DELETE TABLE command.
- Drop table command can also be used to delete complete table but it deletes table structure too. TRUNCATE TABLE doesn't delete the structure of the table.
Syntax: 
```
TRUNCATE TABLE table_name;  
```

### 9. SQL COPY TABLE
- If you want to copy the data of one SQL table into another SQL table in the same SQL server, then it is possible by using the SELECT INTO statement in SQL.

- The SELECT INTO statement in Structured Query Language copies the content from one existing table into the new table. SQL creates the new table by using the structure of the existing table.

### Syntax of SELECT INTO statement in SQL
```
SELECT * INTO New_table_name FROM old_table_name;  
```

### Syntax of SELECT INTO statement with WHERE clause in SQL
```
SELECT * INTO New_table_name FROM old_table_name WHERE [ condition ] ;  
```

### 10. SQL ALTER TABLE
- The ALTER TABLE statement in Structured Query Language allows you to add, modify, and delete columns of an existing table. This statement also allows database users to add and remove various SQL constraints on the existing tables.
- Any user can also change the name of the table using this statement.
### ALTER TABLE ADD Column statement in SQL
In many situations, you may require to add the columns in the existing table. Instead of creating a whole table or database again you can easily add single and multiple columns using the ADD keyword.

### Syntax of ALTER TABLE ADD Column statement in SQL
```
ALTER TABLE table_name ADD column_name column-definition;
```

The above syntax only allows you to add a single column to the existing table. If you want to add more than one column to the table in a single SQL statement, then use the following syntax:
```
ALTER TABLE table_name     
ADD (column_Name1 column-definition,    
column_Name2 column-definition,    
.....    
column_NameN column-definition);    
```

#### ALTER TABLE MODIFY Column statement in SQL
The MODIFY keyword is used for changing the column definition of the existing table.

#### Syntax of ALTER TABLE MODIFY Column statement in SQL
```
ALTER TABLE table_name MODIFY column_name column-definition;  
```
This syntax only allows you to modify a single column of the existing table. If you want to modify more than one column of the table in a single SQL statement, then use the following syntax:

```
ALTER TABLE table_name     
MODIFY (column_Name1 column-definition,    
column_Name2 column-definition,    
.....    
column_NameN column-definition);    
```

#### ALTER TABLE DROP Column statement in SQL
In many situations, you may require to delete the columns from the existing table. Instead of deleting the whole table or database you can use DROP keyword for deleting the columns.

#### Syntax of ALTER TABLE DROP Column statement in SQL
```
ALTER TABLE table_name DROP Column column_name ;  
```

#### ALTER TABLE RENAME Column statement in SQL
The RENAME keyword is used for changing the name of columns or fields of the existing table.

#### Syntax of ALTER TABLE RENAME Column statement in SQL
```
ALTER TABLE table_name RENAME COLUMN old_name to new_name;   
```

# SQL SELECT Statement
The SELECT statement is the most commonly used command in Structured Query Language. It is used to access the records from one or more database tables and views. It also retrieves the selected data that follow the conditions we want.

In [12]:
!ls

 dbms-sql-command.png
 Difference-Between-SQL-and-MySQL-Comparison-Summary.jpg
'Introduction to SQL.ipynb'
 README.md
'relational theory.png'
'SQL interview Questions and Answers.ipynb'
 types-of-databases4.png
 types-of-databases.png
 what-is-rdbms.png
 world-university-rankings-202223

In [5]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Pucit12345#",
  database="ehtisham",
  auth_plugin='mysql_native_password'
)
cur = mydb.cursor()  
sql = "insert into STUDENTS(ID, NAME, AGE, ADDRESS) values (%s, %s, %s, %s)"  
  
#The row values are provided in the form of tuple   
val = (110,'Ahmed', 20 , "Lahore")  
  
try:  
    cur.execute(sql,val)  
    mydb.commit()
except:  
    mydb.rollback()  
print(cur.rowcount,"record inserted!")  
mydb.close()

1 record inserted!

In [8]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Pucit12345#",
  database="ehtisham",
  auth_plugin='mysql_native_password'
)
cur = mydb.cursor()  
try:  
    #Reading the Employee data      
    cur.execute("select * from STUDENTS")  
  
    #fetching the rows from the cursor object  
    result = cur.fetchall()  
    #printing the result  
      
    for x in result:  
        print(x);  
except:  
    mydb.rollback()  
mydb.close()

(110, 'Ahmed', 20, 'Lahore')
(501, 'Aleema ', 21, 'Lahore')
(502, 'Azka', 21, 'Rawalpandi')
(521, 'Ehtisham', 21, 'Okara')